#ifndef __SSIINTERFACE_H_
#define __SSIINTERFACE_H_

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/

#define HAL_SSI0_SSICR0_ADDR            ( 0x0000 )                              /* 控制寄存器0 */
#define HAL_SSI0_SSICR1_ADDR            ( 0x0004 )                              /* 控制寄存器1 */
#define HAL_SSI0_SSICR2_ADDR            ( 0x0008 )                              /* 控制寄存器2 */
#define HAL_SSI0_SSICR3_ADDR            ( 0x000C )                              /* 控制寄存器3 */
#define HAL_SSI0_SSICR4_ADDR            ( 0x0010 )                              /* 控制寄存器4 */
#define HAL_SSI0_SSIDR_ADDR             ( 0x0014 )                              /* 数据寄存器 */
#define HAL_SSI0_SSISR_ADDR             ( 0x0018 )                              /* 状态寄存器 */


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/


/*****************************************************************************
 联合名    : HAL_SSI_SSICR0_UNION
 联合说明  : SSICR0寄存器定义
*****************************************************************************/
typedef union
{
    PHY_UINT32                          uwValue;

    struct
    {
        PHY_UINT32                      ASS                 : 3;                /* 设置地址位宽,支持1－8bit */
        PHY_UINT32                      DSS                 : 5;                /* 设置数据位宽,支持2-24bit */
        PHY_UINT32                      RESVERED            : 24;               /* unassigned */
    }stReg;
}HAL_SSI_SSICR0_UNION;


/*****************************************************************************
 联合名    : HAL_SSI_SSICR3_UNION
 联合说明  : SSICR3寄存器定义
*****************************************************************************/
typedef union
{
    PHY_UINT32                          uwValue;

    struct
    {
        PHY_UINT32                      TXFIFO_WL           : 3;                /* 设置发送FIFO水线 */
        PHY_UINT32                      RXFIFO_WL           : 3;                /* 设置接收FIFO水线 */
        PHY_UINT32                      RESVERED            : 26;               /* unassigned */
    }stReg;
}HAL_SSI_SSICR3_UNION;


/*****************************************************************************
 联合名    : HAL_SSI_SSISR_UNION
 联合说明  : SSISR寄存器定义
*****************************************************************************/
typedef union
{
    PHY_UINT32                          uwValue;

    struct
    {
        PHY_UINT32                      TFE                 : 1;                /* 发送FIFO 是否已空 */
        PHY_UINT32                      TNF                 : 1;                /* 发送FIFO 是否未满 */
        PHY_UINT32                      RNE                 : 1;                /* 接收FIFO 是否未空 */
        PHY_UINT32                      RFF                 : 1;                /* 接收FIFO是否已满 */
        PHY_UINT32                      BSY                 : 1;                /* SSI 忙标记 */
        PHY_UINT32                      RXFIFO_LV           : 3;                /* 接收FIFO深度（深度最大为8）*/
        PHY_UINT32                      TXFIFO_LV           : 3;                /* 发送FIFO深度（深度最大为8）*/
        PHY_UINT32                      RESVERED            : 20;
    }stReg;
}HAL_SSI_SSISR_UNION;

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif