/* 头文件包含 */
#include "OmUsbPpm.h"


/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbCfgSendData_case1(VOS_VOID)
{
    VOS_UINT8                               aucVirAddr[100];
    VOS_UINT8                               aucPhyAddr[100];

    return PPM_UsbCfgSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbIndSendData_case1(VOS_VOID)
{
    VOS_UINT8                               aucVirAddr[100];
    VOS_UINT8                               aucPhyAddr[100];

    return PPM_UsbIndSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbCfgPortClose_case1(VOS_VOID)
{
    PPM_UsbCfgPortClose();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbIndPortClose_case1(VOS_VOID)
{
    PPM_UsbIndPortClose();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbCfgStatusCB_case1(VOS_VOID)
{
    PPM_UsbCfgStatusCB(ACM_EVT_DEV_SUSPEND);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbIndStatusCB_case1(VOS_VOID)
{
    PPM_UsbIndStatusCB(ACM_EVT_DEV_SUSPEND);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbCfgWriteDataCB_case1(VOS_VOID)
{
    VOS_UINT8                               aucVirAddr[100];
    VOS_UINT8                               aucPhyAddr[100];

    PPM_UsbCfgWriteDataCB(aucVirAddr, aucPhyAddr, 100);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbIndWriteDataCB_case1(VOS_VOID)
{
    VOS_UINT8                               aucVirAddr[100];
    VOS_UINT8                               aucPhyAddr[100];

    PPM_UsbIndWriteDataCB(aucVirAddr, aucPhyAddr, 100);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_INT32 uttest_PPM_UsbCfgReadDataCB_case1(VOS_VOID)
{
    return PPM_UsbCfgReadDataCB();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbCfgPortOpen_case1(VOS_VOID)
{
    PPM_UsbCfgPortOpen();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_UsbIndPortOpen_case1(VOS_VOID)
{
    PPM_UsbIndPortOpen();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbCfgPortInit_case1(VOS_VOID)
{
    return PPM_UsbCfgPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbCfgPortInit_case2(VOS_VOID)
{
    return PPM_UsbCfgPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbIndPortInit_case1(VOS_VOID)
{
    return PPM_UsbIndPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbIndPortInit_case2(VOS_VOID)
{
    return PPM_UsbIndPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbPortInit_case1(VOS_VOID)
{
    return PPM_UsbPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbPortInit_case2(VOS_VOID)
{
    return PPM_UsbPortInit();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_UsbPortInit_case3(VOS_VOID)
{
    return PPM_UsbPortInit();
}