/* 头文件包含 */

#include "TafOamInterface.h"
#include "OmHsicPpm.h"


extern OM_HSIC_PORT_STATUS_ENUM_UINT32         g_ulOmHsicConnectStatus;

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_UINT32 uttest_PPM_GetHsicPortStatus_case1(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_OFF;

    return PPM_GetHsicPortStatus();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicIndWriteDataCB_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    PPM_HsicCfgWriteDataCB(aucVirAddr, aucPhyAddr, 100);

}




/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_INT32 uttest_PPM_HsicCfgReadDataCB_case1(VOS_VOID)
{
    return PPM_HsicCfgReadDataCB();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_INT32 uttest_PPM_HsicCfgReadDataCB_case2(VOS_VOID)
{
    return PPM_HsicCfgReadDataCB();
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicCfgWriteDataCB_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    PPM_HsicCfgWriteDataCB(aucVirAddr, aucPhyAddr, 100);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicCfgPortOpen_case1(VOS_VOID)
{
    PPM_HsicCfgPortOpen();

    return;
}


/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicIndPortOpen_case1(VOS_VOID)
{
    PPM_HsicIndPortOpen();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicIndPortClose_case1(VOS_VOID)
{
    PPM_HsicIndPortClose();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/

VOS_VOID uttest_PPM_HsicCfgPortClose_case1(VOS_VOID)
{
    PPM_HsicCfgPortClose();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_HsicIndSendData_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_HsicIndSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_HsicCfgSendData_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_HsicCfgSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicIndStatusCB_case1(VOS_VOID)
{
    PPM_HsicIndStatusCB(ACM_EVT_DEV_SUSPEND);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicCfgStatusCB_case1(VOS_VOID)
{
    PPM_HsicCfgStatusCB(ACM_EVT_DEV_SUSPEND);

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicPortInit_case1(VOS_VOID)
{
    PPM_HsicPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicPortInit_case2(VOS_VOID)
{
    PPM_HsicPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicPortInit_case3(VOS_VOID)
{
    PPM_HsicPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicConnectProc_case1(VOS_VOID)
{
    PPM_HsicConnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicConnectProc_case2(VOS_VOID)
{
    PPM_HsicConnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicConnectProc_case3(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_ON;

    PPM_HsicConnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicConnectProc_case4(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_OFF;

    PPM_HsicConnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicDisconnectProc_case1(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_OFF;

    PPM_HsicDisconnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicDisconnectProc_case2(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_OFF;

    PPM_HsicDisconnectProc();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_HsicDisconnectProc_case3(VOS_VOID)
{
    g_ulOmHsicConnectStatus = OM_HSIC_PORT_STATUS_ON;

    PPM_HsicDisconnectProc();

    return;
}

