/* 头文件包含 */
#include "OmVcomPpm.h"
#include "AtAppVcomInterface.h"
#include "dms.h"


/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_INT uttest_PPM_VComCfgReadData_case1(VOS_VOID)
{
    VOS_UINT8                           aucData[100];

    return PPM_VComCfgReadData(DMS_VCOM_OM_CHAN_DATA, aucData, sizeof(aucData));
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_INT uttest_PPM_VComCfgReadData_case2(VOS_VOID)
{
    VOS_UINT8                           aucData[100];

    return PPM_VComCfgReadData(DMS_VCOM_OM_CHAN_CTRL, VOS_NULL_PTR, sizeof(aucData));
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_INT uttest_PPM_VComCfgReadData_case3(VOS_VOID)
{
    VOS_UINT8                           aucData[100];

    return PPM_VComCfgReadData(DMS_VCOM_OM_CHAN_CTRL, aucData, sizeof(aucData));
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_INT uttest_PPM_VComCfgReadData_case4(VOS_VOID)
{
    VOS_UINT8                           aucData[100];

    return PPM_VComCfgReadData(DMS_VCOM_OM_CHAN_CTRL, aucData, sizeof(aucData));
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_VComCfgSendData_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_VComCfgSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_VComCfgSendData_case2(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_VComCfgSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_VComIndSendData_case1(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_VComIndSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_UINT32 uttest_PPM_VComIndSendData_case2(VOS_VOID)
{
    VOS_UINT8                           aucVirAddr[100];
    VOS_UINT8                           aucPhyAddr[100];

    return PPM_VComIndSendData(aucVirAddr, aucPhyAddr, 100);
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_VComCfgPortInit_case1(VOS_VOID)
{
    PPM_VComCfgPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_VComIndPortInit_case1(VOS_VOID)
{
    PPM_VComCfgPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_VComPortInit_case1(VOS_VOID)
{
    PPM_VComPortInit();

    return;
}

/*******************************************************************
*测试项:
*被测函数功能描述:
*预期结果：
************************* 修改记录 *************************
#  1.日    期:
#    作    者:
#    修改内容:
*******************************************************************/
VOS_VOID uttest_PPM_VComInfoShow_case1(VOS_VOID)
{
    PPM_VComInfoShow();

    return;
}

